# Pandas DataFrame
* isnull()
* notnull()
* dropna()
* fillna()
* replace()
* interpolate()

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
titanic_train = pd.read_csv("titanic.csv")
titanic_train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic_train.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
titanic_train.shape

(891, 12)

In [6]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### For datatype object

In [7]:
titanic_train.dtypes == 'object'
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [8]:
titanic_train.dtypes == 'object'
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a
titanic_train[a].describe()

                       Name   Sex    Ticket    Cabin Embarked
count                   891   891       891      204      889
unique                  891     2       681      147        3
top     Doling, Miss. Elsie  male  CA. 2343  B96 B98        S
freq                      1   577         7        4      644

In [9]:
titanic_train.dtypes[titanic_train.dtypes == 'object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [10]:
titanic_train.dtypes[titanic_train.dtypes == 'object'].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [11]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "object"].index
titanic_train[list_col].describe()

                       Name   Sex    Ticket    Cabin Embarked
count                   891   891       891      204      889
unique                  891     2       681      147        3
top     Doling, Miss. Elsie  male  CA. 2343  B96 B98        S
freq                      1   577         7        4      644

### For datatype int64

In [12]:
titanic_train.dtypes[titanic_train.dtypes == 'int64']

PassengerId    int64
Survived       int64
Pclass         int64
SibSp          int64
Parch          int64
dtype: object

In [13]:
titanic_train.dtypes[titanic_train.dtypes == 'int64'].index

Index(['PassengerId', 'Survived', 'Pclass', 'SibSp', 'Parch'], dtype='object')

In [14]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "int64"].index
titanic_train[list_col].describe()

       PassengerId    Survived      Pclass       SibSp       Parch
count   891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642    0.523008    0.381594
std     257.353842    0.486592    0.836071    1.102743    0.806057
min       1.000000    0.000000    1.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000    0.000000    0.000000
50%     446.000000    0.000000    3.000000    0.000000    0.000000
75%     668.500000    1.000000    3.000000    1.000000    0.000000
max     891.000000    1.000000    3.000000    8.000000    6.000000

In [15]:
titanic_train[['Name','Sex','Age','Embarked']]

                                                  Name     Sex   Age Embarked
0                              Braund, Mr. Owen Harris    male  22.0        S
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0        C
2                               Heikkinen, Miss. Laina  female  26.0        S
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0        S
4                             Allen, Mr. William Henry    male  35.0        S
..                                                 ...     ...   ...      ...
886                              Montvila, Rev. Juozas    male  27.0        S
887                       Graham, Miss. Margaret Edith  female  19.0        S
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN        S
889                              Behr, Mr. Karl Howell    male  26.0        C
890                                Dooley, Mr. Patrick    male  32.0        Q

[891 rows x 4 columns]

In [16]:
sorted(titanic_train["Name"])[5:10:2]  # Check the first 15 sorted names

['Adahl, Mr. Mauritz Nils Martin',
 'Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Albimona, Mr. Nassef Cassem']

In [17]:
titanic_train["Name"].describe()

count                     891
unique                    891
top       Doling, Miss. Elsie
freq                        1
Name: Name, dtype: object

In [18]:
titanic_train["Ticket"].describe()

count          891
unique         681
top       CA. 2343
freq             7
Name: Ticket, dtype: object

In [19]:
titanic_train[["Ticket"]][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [20]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [51]:
titanic_train["NewClass"] = "sshh"
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NewClass,Cabin1,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,sshh,n,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,sshh,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,sshh,n,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,sshh,C,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,sshh,n,0

In [22]:
titanic_train["Cabin"][0:15]  # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [23]:
titanic_train["Fare"][0:7]

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
5     8.4583
6    51.8625
Name: Fare, dtype: float64

In [24]:
titanic_train["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [25]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])

new_Pclass

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [26]:
titanic_train["Cabin"].unique()   #check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [27]:

char_cabin = titanic_train["Cabin"].astype(str)  # Convert data to string

new_Cabin = [cabin[0] for cabin in char_cabin]   # Take first letter

new_Cabin = pd.Categorical(new_Cabin)
#new cabin
new_Cabin

[n, C, n, C, n, ..., n, B, n, C, n]
Length: 891
Categories (9, object): [A, B, C, D, ..., F, G, T, n]

In [28]:
titanic_train["Cabin"] = new_Cabin
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NewClass
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,sshh
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,sshh
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,sshh
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,sshh
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,sshh

In [29]:
titanic_train["Cabin1"] = new_Cabin
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NewClass,Cabin1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,sshh,n
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,sshh,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,sshh,n
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,sshh,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,sshh,n

In [30]:
titanic_train["Age"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [31]:
missing = np.where(titanic_train["Age"].isnull() == True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154, 158, 159, 166, 168, 176, 180, 181, 185, 186,
        196, 198, 201, 214, 223, 229, 235, 240, 241, 250, 256, 260, 264,
        270, 274, 277, 284, 295, 298, 300, 301, 303, 304, 306, 324, 330,
        334, 335, 347, 351, 354, 358, 359, 364, 367, 368, 375, 384, 388,
        409, 410, 411, 413, 415, 420, 425, 428, 431, 444, 451, 454, 457,
        459, 464, 466, 468, 470, 475, 481, 485, 490, 495, 497, 502, 507,
        511, 517, 522, 524, 527, 531, 533, 538, 547, 552, 557, 560, 563,
        564, 568, 573, 578, 584, 589, 593, 596, 598, 601, 602, 611, 612,
        613, 629, 633, 639, 643, 648, 650, 653, 656, 667, 669, 674, 680,
        692, 697, 709, 711, 718, 727, 732, 738, 739, 740, 760, 766, 768,
        773, 776, 778, 783, 790, 792, 793, 815, 825, 826, 828, 832, 837,
        839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [32]:
missing = np.where(titanic_train["Age"].isnull() == False)
missing

(array([  0,   1,   2,   3,   4,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  18,  20,  21,  22,  23,  24,  25,  27,  30,  33,
         34,  35,  37,  38,  39,  40,  41,  43,  44,  49,  50,  51,  52,
         53,  54,  56,  57,  58,  59,  60,  61,  62,  63,  66,  67,  68,
         69,  70,  71,  72,  73,  74,  75,  78,  79,  80,  81,  83,  84,
         85,  86,  88,  89,  90,  91,  92,  93,  94,  96,  97,  98,  99,
        100, 102, 103, 104, 105, 106, 108, 110, 111, 112, 113, 114, 115,
        116, 117, 118, 119, 120, 122, 123, 124, 125, 127, 129, 130, 131,
        132, 133, 134, 135, 136, 137, 138, 139, 141, 142, 143, 144, 145,
        146, 147, 148, 149, 150, 151, 152, 153, 155, 156, 157, 160, 161,
        162, 163, 164, 165, 167, 169, 170, 171, 172, 173, 174, 175, 177,
        178, 179, 182, 183, 184, 187, 188, 189, 190, 191, 192, 193, 194,
        195, 197, 199, 200, 202, 203, 204, 205, 206, 207, 208, 209, 210,
        211, 212, 213, 215, 216, 217, 218, 219, 220, 221, 222, 224, 225,
        226, 227, 228, 230, 231, 232, 233, 234, 236, 237, 238, 239, 242,
        243, 244, 245, 246, 247, 248, 249, 251, 252, 253, 254, 255, 257,
        258, 259, 261, 262, 263, 265, 266, 267, 268, 269, 271, 272, 273,
        275, 276, 278, 279, 280, 281, 282, 283, 285, 286, 287, 288, 289,
        290, 291, 292, 293, 294, 296, 297, 299, 302, 305, 307, 308, 309,
        310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322,
        323, 325, 326, 327, 328, 329, 331, 332, 333, 336, 337, 338, 339,
        340, 341, 342, 343, 344, 345, 346, 348, 349, 350, 352, 353, 355,
        356, 357, 360, 361, 362, 363, 365, 366, 369, 370, 371, 372, 373,
        374, 376, 377, 378, 379, 380, 381, 382, 383, 385, 386, 387, 389,
        390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402,
        403, 404, 405, 406, 407, 408, 412, 414, 416, 417, 418, 419, 421,
        422, 423, 424, 426, 427, 429, 430, 432, 433, 434, 435, 436, 437,
        438, 439, 440, 441, 442, 443, 445, 446, 447, 448, 449, 450, 452,
        453, 455, 456, 458, 460, 461, 462, 463, 465, 467, 469, 471, 472,
        473, 474, 476, 477, 478, 479, 480, 482, 483, 484, 486, 487, 488,
        489, 491, 492, 493, 494, 496, 498, 499, 500, 501, 503, 504, 505,
        506, 508, 509, 510, 512, 513, 514, 515, 516, 518, 519, 520, 521,
        523, 525, 526, 528, 529, 530, 532, 534, 535, 536, 537, 539, 540,
        541, 542, 543, 544, 545, 546, 548, 549, 550, 551, 553, 554, 555,
        556, 558, 559, 561, 562, 565, 566, 567, 569, 570, 571, 572, 574,
        575, 576, 577, 579, 580, 581, 582, 583, 585, 586, 587, 588, 590,
        591, 592, 594, 595, 597, 599, 600, 603, 604, 605, 606, 607, 608,
        609, 610, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624,
        625, 626, 627, 628, 630, 631, 632, 634, 635, 636, 637, 638, 640,
        641, 642, 644, 645, 646, 647, 649, 651, 652, 654, 655, 657, 658,
        659, 660, 661, 662, 663, 664, 665, 666, 668, 670, 671, 672, 673,
        675, 676, 677, 678, 679, 681, 682, 683, 684, 685, 686, 687, 688,
        689, 690, 691, 693, 694, 695, 696, 698, 699, 700, 701, 702, 703,
        704, 705, 706, 707, 708, 710, 712, 713, 714, 715, 716, 717, 719,
        720, 721, 722, 723, 724, 725, 726, 728, 729, 730, 731, 733, 734,
        735, 736, 737, 741, 742, 743, 744, 745, 746, 747, 748, 749, 750,
        751, 752, 753, 754, 755, 756, 757, 758, 759, 761, 762, 763, 764,
        765, 767, 769, 770, 771, 772, 774, 775, 777, 779, 780, 781, 782,
        784, 785, 786, 787, 788, 789, 791, 794, 795, 796, 797, 798, 799,
        800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812,
        813, 814, 816, 817, 818, 819, 820, 821, 822, 823, 824, 827, 829,
        830, 831, 833, 834, 835, 836, 838, 840, 841, 842, 843, 844, 845,
        847, 848, 850, 851, 852, 853, 854, 855, 856, 857, 858, 860, 861,
        862, 864, 865, 866, 867, 869, 870, 871, 872, 873, 874, 875, 876,
        877, 879, 880, 881, 882, 883, 884, 885, 886, 887, 889, 890],
       dtype=int64),)

In [33]:
#find out where the highest fare is
np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

(array([258, 679, 737], dtype=int64),)

In [34]:
titanic_train.iloc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NewClass,Cabin1
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,n,C,sshh,n
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B,C,sshh,B
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B,C,sshh,B

In [35]:
len(missing[0])

714

In [36]:
titanic_train.iloc[np.where(titanic_train["PassengerId"]==max(titanic_train["PassengerId"]))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NewClass,Cabin1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,n,Q,sshh,n

In [53]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family

titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NewClass,Cabin1,Family
159,160,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,CA. 2343,69.55,n,S,sshh,n,10
180,181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.55,n,S,sshh,n,10
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.55,n,S,sshh,n,10
324,325,0,3,"Sage, Mr. George John Jr",male,NaN,8,2,CA. 2343,69.55,n,S,sshh,n,10
792,793,0,3,"Sage, Miss. Stella Anna",female,NaN,8,2,CA. 2343,69.55,n,S,sshh,n,10
846,847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.55,n,S,sshh,n,10
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.55,n,S,sshh,n,10

In [38]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)
pd.Series(my_data, index=labels)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [39]:
pd.Series(labels, index=my_data)

10    a
20    b
30    c
dtype: object

In [40]:
print("\nHolding numerical data\n", '-'*50, sep='')
print(pd.Series(arr)[1])

Holding numerical data
--------------------------------------------------
20

In [41]:
print("\nHolding numerical data\n", '-'*50, sep='')
print(pd.Series(my_data))

Holding numerical data
--------------------------------------------------
0    10
1    20
2    30
dtype: int64

In [42]:
print("\nHolding numerical data\n", '-'*50, sep='')
print(pd.Series(labels))

Holding numerical data
--------------------------------------------------
0    a
1    b
2    c
dtype: object

In [43]:
d = {'a':"abss", 'b':20,'c':30}
d.items
pd.DataFrame(d,index = ['a','b','c'])

      a   b   c
a  abss  20  30
b  abss  20  30
c  abss  20  30

In [44]:
print("\nHolding objects from a dictionary\n",'-'*50, sep='')
print(pd.Series([type, sum, max]))

Holding objects from a dictionary
--------------------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [45]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser2 = pd.Series([1,2,5,4], ['CA','OR','NV','AZ'])
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [46]:
ser2

CA    1
OR    2
NV    5
AZ    4
dtype: int64

In [47]:
ser1[0:3:2]

2    1
6    3
dtype: int64

In [54]:
print("\nIndexing by a range\n", '-'*50, sep='')
print("Value for OR, CO, and AZ in ser1:\n", ser1[0:3:2], sep='')

Indexing by a range
--------------------------------------------------
Value for OR, CO, and AZ in ser1:
2    1
6    3
dtype: int64

In [55]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR','CO','CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ', 'OR'])
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [56]:
print("\nAfter adding the two series, the result looks like this:\n",'-'*50, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this:
--------------------------------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [57]:
print("\n The idea works even for multiplication...\n", '-'*50,sep='')
print(ser1*ser2)

 The idea works even for multiplication...
--------------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [59]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data, row_labels, column_headings)

df

          W         X         Y         Z
A  0.335724  0.915687  0.052332 -0.521896
B  1.499860  0.209093  1.694997  0.190784
C  0.613386 -0.669596 -0.276043 -0.380020
D -2.556622  0.060901  1.553842 -0.099616
E  1.624755 -0.423433  1.086542 -1.252341

In [60]:
df.iloc[2]

W    0.613386
X   -0.669596
Y   -0.276043
Z   -0.380020
Name: C, dtype: float64

In [61]:
df.iloc[2,3]

-0.380019743129107

In [62]:
print("\nType of the pair of columns: ", type(df[['X','Z']])),
print("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns:  <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [63]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n", '-'*50, sep='')
print(df["X"])

The 'X' column accessed by DOT method (NOT recommended)
--------------------------------------------------
A    0.915687
B    0.209093
C   -0.669596
D    0.060901
E   -0.423433
Name: X, dtype: float64

In [64]:
print("\nA column is created by assigning it in relation to an existing column\n", '-'*50, sep='')
df['New'] = df['X']+df['Z']
df['New(Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
--------------------------------------------------
          W         X         Y         Z       New  New(Sum of X and Z)
A  0.335724  0.915687  0.052332 -0.521896  0.393791             0.393791
B  1.499860  0.209093  1.694997  0.190784  0.399877             0.399877
C  0.613386 -0.669596 -0.276043 -0.380020 -1.049616            -1.049616
D -2.556622  0.060901  1.553842 -0.099616 -0.038714            -0.038714
E  1.624755 -0.423433  1.086542 -1.252341 -1.675774            -1.675774

In [65]:
df

          W         X         Y         Z       New  New(Sum of X and Z)
A  0.335724  0.915687  0.052332 -0.521896  0.393791             0.393791
B  1.499860  0.209093  1.694997  0.190784  0.399877             0.399877
C  0.613386 -0.669596 -0.276043 -0.380020 -1.049616            -1.049616
D -2.556622  0.060901  1.553842 -0.099616 -0.038714            -0.038714
E  1.624755 -0.423433  1.086542 -1.252341 -1.675774            -1.675774

In [66]:
df1 = df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n", '-'*50, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
--------------------------------------------------
          W         X         Y         Z       New  New(Sum of X and Z)
B  1.499860  0.209093  1.694997  0.190784  0.399877             0.399877
C  0.613386 -0.669596 -0.276043 -0.380020 -1.049616            -1.049616
D -2.556622  0.060901  1.553842 -0.099616 -0.038714            -0.038714
E  1.624755 -0.423433  1.086542 -1.252341 -1.675774            -1.675774

In [67]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*50, sep='')
df.drop('New(Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
--------------------------------------------------
          W         X         Y         Z       New
A  0.335724  0.915687  0.052332 -0.521896  0.393791
B  1.499860  0.209093  1.694997  0.190784  0.399877
C  0.613386 -0.669596 -0.276043 -0.380020 -1.049616
D -2.556622  0.060901  1.553842 -0.099616 -0.038714
E  1.624755 -0.423433  1.086542 -1.252341 -1.675774

In [68]:
df

          W         X         Y         Z       New
A  0.335724  0.915687  0.052332 -0.521896  0.393791
B  1.499860  0.209093  1.694997  0.190784  0.399877
C  0.613386 -0.669596 -0.276043 -0.380020 -1.049616
D -2.556622  0.060901  1.553842 -0.099616 -0.038714
E  1.624755 -0.423433  1.086542 -1.252341 -1.675774

In [72]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n", '-'*50, sep='')
print("\nSingle row\n")
print(df.iloc[3])

Label-based 'loc' method can be used for selecting row(s)
--------------------------------------------------

Single row

W     -2.556622
X      0.060901
Y      1.553842
Z     -0.099616
New   -0.038714
Name: D, dtype: float64

In [73]:
print("\nMultiple rows\n")
print(df.loc[['B','C']])

Multiple rows

          W         X         Y         Z       New
B  1.499860  0.209093  1.694997  0.190784  0.399877
C  0.613386 -0.669596 -0.276043 -0.380020 -1.049616

In [74]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*50, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
--------------------------------------------------

Single row

W      0.613386
X     -0.669596
Y     -0.276043
Z     -0.380020
New   -1.049616
Name: C, dtype: float64

In [78]:
print("\nMultiple rows\n")
print(df.iloc[[1,4]])

Multiple rows

          W         X         Y         Z
B  1.499860  0.209093  1.694997  0.190784
E  1.624755 -0.423433  1.086542 -1.252341

In [79]:
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [80]:
print("\nThe DataFrame\n", '-'*50, sep='')
print(df)

The DataFrame
--------------------------------------------------
          W         X         Y         Z
A  0.410230 -0.817965 -0.398273  0.350117
B -0.795904 -1.375165  0.499663  0.521537
C  0.490590  1.032118 -0.028243 -1.642492
D -0.256723  0.137294 -0.017656 -1.620032
E  0.750089 -0.283133  0.980849 -0.127438

In [81]:
print("\nElement at row 'B' and column 'Y' is\n")
print(df.loc[['B','C'],['Y','W']])

Element at row 'B' and column 'Y' is

          Y         W
B  0.499663 -0.795904
C -0.028243  0.490590

In [82]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows B and D, and columns W and Y, is

          W         X
B -0.795904 -1.375165
C  0.490590  1.032118
D -0.256723  0.137294

In [83]:
print(df.loc[['B','C'],])

          W         X         Y         Z
B -0.795904 -1.375165  0.499663  0.521537
C  0.490590  1.032118 -0.028243 -1.642492

In [84]:
print("\nThe DataFrame\n", '-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z
A  0.410230 -0.817965 -0.398273  0.350117
B -0.795904 -1.375165  0.499663  0.521537
C  0.490590  1.032118 -0.028243 -1.642492
D -0.256723  0.137294 -0.017656 -1.620032
E  0.750089 -0.283133  0.980849 -0.127438

In [85]:
print("\nBoolean DataFrame where we are checking if the values are greater than 0\n", '-'*50, sep='')
print(df>0)

Boolean DataFrame where we are checking if the values are greater than 0
--------------------------------------------------
       W      X      Y      Z
A   True  False  False   True
B  False  False   True   True
C   True   True  False  False
D  False   True  False  False
E   True  False   True  False

In [86]:
print(df<0)

       W      X      Y      Z
A  False   True   True  False
B   True   True  False  False
C  False  False   True   True
D   True  False   True   True
E  False   True  False   True

In [87]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A   True  False  False   True
B  False  False   True   True
C   True   True  False  False

In [88]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n", '-'*50, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
--------------------------------------------------
          W         X         Y         Z
A  0.410230       NaN       NaN  0.350117
B       NaN       NaN  0.499663  0.521537
C  0.490590  1.032118       NaN       NaN
D       NaN  0.137294       NaN       NaN
E  0.750089       NaN  0.980849       NaN

### matrix data

In [89]:
matrix_data = np.matrix('22,33,44;55,66,77;23,34,56;12,23,34;88,99,10')
row_labels = ['A','B','C','D','E']
column_headings = ['Age','Height','Weight']
matrix_data

matrix([[22, 33, 44],
        [55, 66, 77],
        [23, 34, 56],
        [12, 23, 34],
        [88, 99, 10]])

In [91]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n", '-'*50, sep='')
print(df)

A new DataFrame
--------------------------------------------------
   Age  Height  Weight
A   22      33      44
B   55      66      77
C   23      34      56
D   12      23      34
E   88      99      10

In [92]:
df[df['Height']>50]

   Age  Height  Weight
B   55      66      77
E   88      99      10

In [95]:
df['Height']>50

A    False
B     True
C    False
D    False
E     True
Name: Height, dtype: bool

In [99]:
booldf1 = df['Height']>30
booldf2 = df['Weight']>40

In [100]:
print("\nRows with Height > 20 inch and Weight > 10 lbs\n", '-'*50,sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 20 inch and Weight > 10 lbs
--------------------------------------------------
   Age  Height  Weight
A   22      33      44
B   55      66      77
C   23      34      56

In [101]:
print("\nDataFrame with only Age and Weight columns whose Height > 20\n",'-'*50, sep='')
print(df[booldf1][['Age', 'Weight']])

DataFrame with only Age and Weight columns whose Height > 20
--------------------------------------------------
   Age  Weight
A   22      44
B   55      77
C   23      56
E   88      10

In [102]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [103]:
df = pd.DataFrame(data=matrix_data, index=row_labels,columns=column_headings)
print("\nThe DataFrame\n",'-'*50, sep='')
print(df)

The DataFrame
--------------------------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [105]:
print("\nAfter resetting index\n", '-'*50, sep='')
print(df.reset_index())

After resetting index
--------------------------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [106]:
print("\nAfter resetting index with 'drop' option TRUE\n", '-'*50,sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

After resetting index with 'drop' option TRUE
--------------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [107]:
print("\nAdding a new column 'Profession'\n", '-'*50, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
df

Adding a new column 'Profession'
--------------------------------------------------

   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [109]:
print("\nSettting 'Profession' column as index\n", '-'*50, sep='')
df.set_index('Profession')

Settting 'Profession' column as index
--------------------------------------------------

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

### multi-indexing
### Index Levels

In [110]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [111]:
print("\nTuple pairs after the zip and list command\n",'-'*50, sep='')
print(hier_index)

Tuple pairs after the zip and list command
--------------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [112]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n", '-'*50, sep='')
print(hier_index)

Index hierarchy
--------------------------------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [113]:
print("\nIndex hierarchy type\n", '-'*50, sep='')
print(type(hier_index))

Index hierarchy type
--------------------------------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [114]:
print("\nCreating DataFrame with multi-index\n", '-'*50, sep='')
df1 = pd.DataFrame(data = np.round(rn(6,3)), index=hier_index, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
--------------------------------------------------
        A    B    C
G1 1 -1.0  1.0  2.0
   2  1.0  0.0  1.0
   3  1.0 -0.0  0.0
G2 1  0.0 -1.0  1.0
   2 -0.0 -0.0 -1.0
   3  2.0 -0.0 -1.0

In [115]:
#cross tabulation like pivot table

print("\nGrabbing a cross-section from outer level\n", '-'*50, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
--------------------------------------------------
     A    B    C
1 -1.0  1.0  2.0
2  1.0  0.0  1.0
3  1.0 -0.0  0.0